{"data":[{"id":"1518018318661144576","text":"Our final #AskAReporter of the day:\n\nLos Angeles 2022: Inside the mayor, council and sheriff races 🗳️\n\n@Erika_D_Smith, @AleneTchek, @sherlyholmes and @GustavoArellano (left to right) host a live podcast 🎙️ #FestivalofBooks https://t.co/RKU04CZpQq"},{"id":"1518017126119968769","text":"Granada Hills Charter wins national academic decathlon https://t.co/S4TXoZcegm"},{"id":"1518017123410333697","text":"As the Kings inch closer to their first playoff spot since 2018, Dustin Brown sees similarities to what he endured as a young player before winning two Stanley Cups. https://t.co/Sg7MSAgt1N"},{"id":"1518016116597026816","text":"Akwaeke Emezi (@azemezi), author of “Bitter” and “The Death of Vivek Oji,” stops by #bookfest and the @latimesfob photo studio.\n\n📸: @jaylclendenin https://t.co/9tu3ptU46T"},{"id":"1518014713392771072","text":"With new evidence coming to light daily of atrocities against civilians by Russian troops in territory they previously occupied or now control, Zelensky repeated his call for war crimes accountability.\n\nIn this photo, families mourn at a cemetery in Bucha. https://t.co/mu29icnw3T https://t.co/b19xPb1ejl"},{"id":"1518014709332643851","text":"Moscow is pressing ahead with an offensive in Ukraine’s eastern industrial heartland as it seeks to gain full control over the provinces of Donetsk and Luhansk, known together as the Donbas. https://t.co/mu29icnw3T"},{"id":"1518014707969495042","text":"Ukrainian President Volodymyr Zelensky, meanwhile, said that two senior U.S. officials — Secretary of State Antony J. Blinken and the Secretary of Defense Lloyd J. Austin III — would arrive Sunday in the capital. https://t.co/mu29icnw3T"},{"id":"1518014706413412354","text":"Russian and Ukrainian troops faced off today along a 300-mile battlefront in the country’s east, where Ukraine said it beat back numerous attacks but faced renewed shelling in Mariupol. https://t.co/mu29icnw3T"},{"id":"1518011843444449280","text":"“A lot of us are still trying to process this emotional blow to our city and festival fans across the state,” said Gilroy Vice-Mayor Peter Leroe-Muñoz.\n\nThe big question now is whether Gilroy can revive or somehow replace the massive event. https://t.co/A4XujFCLvU"},{"id":"1518010116380889088","text":"Charity Chandler-Cole (@CASAofLA) discusses the responsibilities of being a foster parent, which she says includes not only loving and caring for a child, but also being supportive of their reunification process #AskAReporter #FestivalofBooks https://t.co/je3IsxdGR8"},{"id":"1518007275943698432","text":".@luisjrodriguez, an American poet, novelist, journalist, critic, and columnist stops by the @latimesfob portrait studio.\n\n📸: @jaylclendenin https://t.co/2uqXfkKBvQ"},{"id":"1518006810715766786","text":"Amanda Gorman has made her first in-person, public performance since reading at President Biden’s inauguration ceremony. \n\nWatch her read “Fugue,\" from her latest book of poetry, here: https://t.co/FkIT6lzFKR"},{"id":"1518004774435639297","text":".@MarkHarrisNYC, author of “Pictures at a Revolution,” “Five Came Back” and more, stops by the @latimesfob photo studio.\n\n📸: @jaylclendenin https://t.co/oCgEaVAWYL"},{"id":"1518004264693424128","text":"\"Mentorship isn’t a cure-all. But it can make a profound difference in the life of a child who will suddenly feel less alone.\" (via @latimesopinion) https://t.co/lYSUsQRcPF"},{"id":"1518004263581933569","text":"Thinking of becoming a foster parent in Los Angeles?\n\nHere's how:\nhttps://t.co/L2Oc8BC4oE"},{"id":"1518003908072804352","text":"Learn more about getting the most out of your trip to the Festival of Books. https://t.co/FXrdXZTnZw"},{"id":"1518002878165643265","text":"Our sixth #AskAReporter event: How to be a foster parent.\n\nColumnist @AbcarianLAT talks w/ Charity Chandler-Cole, executive director of @CASAofLA #FestivalofBooks https://t.co/PpSL9LM4vi"},{"id":"1518002395883601921","text":".@RepAdamSchiff stops by the @latimesfob photo studio at #bookfest, where he's on a panel for his book “Midnight in Washington.”\n\n📸: @jaylclendenin https://t.co/AEobQznLd1"},{"id":"1518002029444186120","text":"Writing, Amanda Gorman told the crowd, often reminds her of gridlock.\n\n“Poetry can be like being stuck on the 405 in traffic,” she said. “You know where you’re going and you know you have to be there by 9 a.m., but are you going to make it? We don’t know.” https://t.co/843E30pL3z"},{"id":"1518001775940407302","text":"Scientists caution against anthropomorphizing P-22, but Angelenos can’t help but see themselves in the big cat. \n\nHe’s carved out a life in a crowded city. \n\nAnd though he’s still handsome for his advanced age, he’s terminally single.\nhttps://t.co/93TLqL8PYe"},{"id":"1518000272760475648","text":"Here's everything you need to know to make the most of your visit to the fest! https://t.co/FXrdXZTnZw"},{"id":"1517999807960207360","text":"Meena Harris (@meena), author of “Ambitious Girl,” stops by #bookfest and the @latimesfob photo studio. \n \n📸: @jaylclendenin https://t.co/g2U6cRYc2A"},{"id":"1517998876585693184","text":"Our fifth #AskAReporter event: award-winning staff photographer @GenaroMolina47 shares his 26 years of 📸 Los Angeles.\n\nCheck out his latest work: https://t.co/6twUX7tKQ5"},{"id":"1517996744386256898","text":"Amanda Gorman talks poetry, the pandemic and 405 traffic on first day of L.A. Times Festival of Books https://t.co/843E30pL3z"},{"id":"1517995114173448192","text":"Some student loans are in line for relief. What’s happening and what you should do now https://t.co/jd3yQNuPkq"},{"id":"1517993609835986948","text":"RT @ldarmiento: The Marcianos are staying on at Guess despite a renewed sexual misconduct scandal. Here's my story. https://t.co/x8WJ8gIxG8"},{"id":"1517993531650068480","text":"If you don’t get credit for as much progress toward forgiveness as you deserve, the department advises you to file a complaint with your servicer.\n\nIf that complaint isn’t resolved to your satisfaction, you can take your case to the FSA. \n\nLearn more here: https://t.co/uw8PfiKB9g"},{"id":"1517993529364164609","text":"Call your servicer and ask for an account of how many payments you’ve made toward loan forgiveness. Then you should check that against your own records, and see how the count changes after the department’s new reforms are put in place. https://t.co/uw8PfiKB9g"},{"id":"1517993526558081024","text":"It’s also important to nail down who your servicer is and what kind of loan you have — in particular, whether you’re in an IDR plan or the Public Service Loan Forgiveness program. \n\nThen, figure out how many payments you’ve made under that plan or program. https://t.co/uw8PfiKB9g"},{"id":"1517993523970293760","text":"The place to start is by having an account at https://t.co/9VVvsp07ox and making sure the agency has your up-to-date contact information. \n\nMake sure to monitor the emails that the agency sends. https://t.co/uw8PfiKB9g"},{"id":"1517993521109733381","text":"The latest changes apply to borrowers enrolled in an “income driven repayment” plan.  \n\nThere are steps you can and should take now to make sure you get the full benefit. Here is a quick summary: https://t.co/uw8PfiKB9g https://t.co/FefqicjMfd"},{"id":"1517993514461765632","text":"If you are a borrower, you do not have to ask for the latest changes to be made to your account. \n\nThe Education Department said it will begin applying them automatically, although you may not see the effect in your account until later this year. https://t.co/uw8PfiKB9g"},{"id":"1517993512419176452","text":"Earlier this week, the Education Department announced that it was reviewing payment records to give borrowers more credit for the progress they’ve been making toward loan forgiveness. https://t.co/uw8PfiKB9g"},{"id":"1517993510204579847","text":"How will the Department of Education's recalculation of student loan debts affect you? \n\nHere's what they're doing and how to figure it out: https://t.co/uw8PfiKB9g"},{"id":"1517991707677282304","text":"Should I use Zillow or Redfin? How should I pick a realtor? What does escrow even mean? \n\nAll great questions. The good news: We have answers. \n\nDon’t miss our step-by-step guide to navigating home buying in Southern California. https://t.co/0aWGcYcz8p"},{"id":"1517986928150253568","text":"\"The leading contenders for L.A. mayor have barely discussed how they would tackle the climate crisis. So I asked them,\" writes energy reporter @Sammy_Roth.\n\nDon't miss the latest edition of Boiling Point, our climate and environment newsletter: https://t.co/1NbeNmUAOZ"},{"id":"1517981643662938112","text":"Marymount California University, a small Catholic school in Rancho Palos Verdes, will close its doors this summer after more than 50 years in operation. https://t.co/6YaSbW8BQJ"},{"id":"1517977361056026624","text":"“Injured player down on the field.”\n\nWhat happens when an NFL player suffers a serious injury – with his family watching on TV? @chargers tight end Donald Parham Jr. and his family lived that reality in December, 93 seconds into a game against the Chiefs.\nhttps://t.co/Mstz2s4tG3"},{"id":"1517976615547981824","text":"The world lost 6 revolutionary composers in one year. How L.A., and only L.A, is paying tribute https://t.co/LFKwSWaE0X"},{"id":"1517976608820416519","text":"Since its founding in 1963, more than 5 million people have attended the Renaissance Pleasure Faire, which began as a humble backyard gathering in Laurel Canyon. \n\nThis year it returns after a two-year absence due to the coronavirus pandemic. https://t.co/Ra7DfVTHay"},{"id":"1517975063764500481","text":"Love to travel? ✈️🚗\nAlways looking for cool tourist destinations?⛰️🏝️\n\nKeep up with the latest stories from @mrcsreynolds #Festivalofbooks https://t.co/5NwrP7LFey"},{"id":"1517972667688579072","text":"Our fourth #AskAReporter event of the day:\n\nHow a travel writer set out to find the 101 best California experiences.\n\n(speakers: @mrcsreynolds &amp; @michellewoo) #Festivalofbooks https://t.co/BsQrnRpNW8"},{"id":"1517971828110766080","text":"Real Estate newsletter: Will soaring mortage rates sink home prices? https://t.co/WChbJkOBzm"},{"id":"1517969775921483776","text":".@jaclyncosgrove, one of our #AskAReporter speakers (#festivalofbooks 📚), is managing the L.A. Times' initiative exploring issues around mental health — medical, structural, personal, societal and definitional.\n\nRead more of their work: https://t.co/cOtlHrzxBM https://t.co/lehpDpd0xb"},{"id":"1517966545787539457","text":"The final hurdle in the Angel Stadium land sale has been cleared. https://t.co/rpxTNpGq8k"},{"id":"1517965447894765568","text":"Joy Williams, author of “Harrow,” stopped by the @latimesfob portrait studio at USC. https://t.co/FXrdXZTnZw\n\n📸: @jaylclendenin https://t.co/adWCRo5zC3"},{"id":"1517965447781445632","text":"In our #AskAReporter event on young people and mental health, the panelists went in depth on how the Covid pandemic in particular has affected many disproportionately.\n\nAnd they added that having open conversations on mental wellbeing going forward is essential #FestivalofBooks https://t.co/di98kW1CmS"},{"id":"1517964086113280000","text":"Here's more on this year's #bookfest and how you can make the most of all the panels and speakers. https://t.co/FXrdXZTnZw"},{"id":"1517961513084063747","text":"Looking for your next weekend trip? Let our Escapes travel newsletter be your guide. Subscribe here: https://t.co/uZPqIW2hWf"},{"id":"1517960878993281024","text":".@meganeabbott, winner of the mystery/thriller award for “The Turnout,” stops by the @latimesfob portrait studio. https://t.co/rI9F6ixziE\n\n📸: @jaylclendenin https://t.co/A3CPaeaTu1"},{"id":"1517960839738773504","text":"@thefilmgoer Our third #AskAReporter event for the day: Mental health and young people.\n\nGuests (left to right): @jaclyncosgrove, @dawntbounds &amp; @DrRobinStevens #FestivalofBooks https://t.co/wElzT9n8bD"},{"id":"1517960248576724992","text":"As the @LAKings inch closer to their first playoff spot since 2018, Dustin Brown sees similarities to what he endured as a young player before winning two Stanley Cups. https://t.co/Sg7MSAgt1N"},{"id":"1517959499813777409","text":"RT @jaclyncosgrove: I’ll be at the @latimesfob #AskAReporter stage today at 1 p.m. with @DrRobinStevens and @dawntbounds talking about the…"},{"id":"1517958989996208128","text":"P-22's quiet, dramatic presence in one of the country’s largest urban parks also has reshaped the way Angelenos think of their city. \n\nDespite its stereotype as a concrete wasteland, few large North American cities have as much biological diversity as L.A.\nhttps://t.co/93TLqLqqPM"},{"id":"1517956726707924993","text":"An open secret that may transform how you’re thinking about your house hunt: You don’t need a 20% down payment to buy a home. https://t.co/TVSgwJ4yvU"},{"id":"1517953957045317634","text":"“The basis of ‘Motomami’ was the pursuit of liberation,” says Rosalía. “As an artist, my ultimate question has always been, ‘How can I be freer?’” https://t.co/Z3pf3UUctU"},{"id":"1517951573472677888","text":"During our #AskAReporter panel, @thefilmgoer goes in depth on the intersection of sports🏀 &amp; entertainment 📺 #Festivalofbooks https://t.co/Yn5C3YnaGV https://t.co/gH86aAJZsI"},{"id":"1517951443336114177","text":"Buying a home in Southern California can feel impossible. But you’re not alone.  \n\nDon’t miss our step-by-step guide to navigating home buying in Southern California. https://t.co/0aWGcYcz8p"},{"id":"1517948990049898499","text":"$1-million milestone: Orange County median home price hits seven figures https://t.co/MOS68E9uzY"},{"id":"1517948924224544768","text":"“This is really good for the (@LAKings) and where they’re headed ... My career is winding down and I want to play meaningful hockey. This is all I could ask for as a player.”\n\nDustin Brown and the Kings inch closer to their first playoff spot since 2018. https://t.co/Sg7MSAy4qn"},{"id":"1517947953150926855","text":"Whether home prices in Orange County and elsewhere surge from here is an open question. \n\n@khouriandrew explains: https://t.co/OzRGjDsJcV"},{"id":"1517947951531929602","text":"According to a recent survey, 64% of California adults view housing affordability as a big problem, with more than half of adults saying they are concerned they won’t have enough money to pay their rent or mortgage. https://t.co/OzRGjDsJcV"},{"id":"1517947948419756032","text":"The Orange County milestone comes as a regionwide lack of affordable housing has pushed people into homelessness and caused others to leave the state in search of shelter. https://t.co/OzRGjDsJcV https://t.co/bdKMl4GEkF"},{"id":"1517947942908444672","text":"Million-dollar homes spread rapidly throughout Southern California during the pandemic, becoming commonplace in communities once thought to be relatively affordable like Highland Park and West Adams in Los Angeles County. https://t.co/eMR3kVQovJ"},{"id":"1517947941243310080","text":"The median home price in Orange County reached $1 million last month. \n\nIt's the first Southern California county to ever hit that pricey mark – underscoring just how expensive the region has become. https://t.co/OzRGjDsJcV"},{"id":"1517946411828002816","text":"Man fatally shot in Florence-Firestone area in Los Angeles County https://t.co/G2lRgoy6kE"},{"id":"1517946205329928192","text":"RT @meridak: Right now @TheAmandaGorman @NatalieJoGraham @latimesfob @latimes “Poetry is really the language of the people.” https://t.co/0…"},{"id":"1517943640970211328","text":"We asked readers to send us their questions about L.A. and California (and found a few additional questions online, too). \n\nWe picked our favorites — and now you get to choose which question we answer first.  \n\nPoll closes tomorrow at 11:59 p.m. https://t.co/L5tjFzcNT8"},{"id":"1517941629155516417","text":"Local tribes have nominated 186 square miles of the Owens lakebed for listing in the California Register of Historical Resources and in the National Register of Historic Places. https://t.co/MN5jHBt0Sr"},{"id":"1517940750218002434","text":".@thefilmgoer, a panelist in our #AskAReporter event, has an episode-by-episode guide to HBO’s ‘Winning Time.\n\nCheck it out:\nhttps://t.co/ySOzWCy0De"},{"id":"1517940748590534656","text":"Love L.A. and basketball? 🏀\n\nCheck out our coverage of the HBO mini-series \n@winningtimehbo https://t.co/uTXLSJBq2d"},{"id":"1517940746308841472","text":"Our second #AskAReporter event of the day: LeBron James &amp; L.A.'s superstar tradition.\n\nOur @LAT_Iliana, @thefilmgoer, @BA_Turner &amp; @BillPlaschke (left to right) discuss the superstar's impact on and off the court — and what he'd have to do to win over Lakers fans #FestivalofBooks https://t.co/nWrrlrpmkP"},{"id":"1517938247292182528","text":"Amanda Gorman takes the stage at the L.A. Times #FestivalofBooks \n\n@latimesfob https://t.co/SrdMTjte1B"},{"id":"1517937599083540481","text":"“Doctor Strange in the Multiverse of Madness,” Marvel’s highly anticipated sequel to the Benedict Cumberbatch-led superhero film, is the latest in a series of Disney movies to be affected by the country’s censorship rules. https://t.co/y64Q7G6dGT"},{"id":"1517936344554774528","text":"The Renaissance Pleasure Faire hath returned for the first time since 2019, throwing open its entrance to revelers, artisans, pirates and Angelenos simply looking to taste some of the finest meads and festival fare in all the land. \n\nFrom @breijOR_THEY: https://t.co/Ra7DfVTHay"},{"id":"1517935748078395393","text":"RT @thefilmgoer: L.A.! Join me (and several thousand other journalism/book lovers) at USC today for the @latimes Festival of Books! \n\nFirst…"},{"id":"1517934386687053825","text":"Huge crowd waiting for Amanda Gorman at the #FestivalofBooks @latimesfob https://t.co/nTLPPWSOJT"},{"id":"1517932872589471744","text":"At our first #AskAReporter event today, @meridak &amp; @cmonstah discuss how the internet has changed the way news is shared.\n\nIt offers reporters new ways to provide info, he says, but they also have the challenging task of combatting misinformation #FestivalofBooks https://t.co/xZFOphxhI3"},{"id":"1517931314942517250","text":"Marymount California University in Rancho Palos Verdes to permanently close Aug. 31 https://t.co/6YaSbW8BQJ"},{"id":"1517931223745712132","text":"RT @meerabee: I loved going growing up in Texas. The last time I went was in SoCal a few years ago and it was so much fun.\n\nFrom @breijOR_T…"},{"id":"1517930604662251523","text":"5 hikes in SoCal for people who just really love trees https://t.co/zkyDmAJkOI"},{"id":"1517927784626020354","text":"Donald Parham Jr.'s parents were watching TV as the @chargers tight end hit the turf last December. \n\n“All of a sudden,” mom Felicia said, “everything went on pause.”\n\nParham and his family recount the hours after a scary injury.\n\nhttps://t.co/Mstz2s4tG3"},{"id":"1517926531263344640","text":"\"The L.A. Phil...is surely the only orchestra anywhere to have programmed all six of these great postwar composers,\" writes Times classical music critic @markswed. https://t.co/LFKwSWaE0X"},{"id":"1517922711686680576","text":"RT @latimesfob: What is @latimes Executive Editor @meridak reading? Well, he’s on the @PulitzerPrizes Board… 👀\n\nBut also, poet and writer @…"},{"id":"1517922626613563392","text":"RT @BillShaikin: Join us as we talk sports books today at the @latimes #FestivalofBooks at USC! I'll be chatting with @BillPlaschke, @pedro…"},{"id":"1517922613200244736","text":"RT @latimesfob: And now, the 2021 @latimes Book Prize for Mystery/Thriller goes to...\n\n@meganeabbott for \"The Turnout: A Novel\" (@PutnamBoo…"},{"id":"1517922499719221248","text":"“One of the stories about the show is how much it’s me, personally,” Lyonne says of #RussianDoll. “It has been my life experience that there’s a lot of stuff that we don’t talk about or that we’re ashamed of.” https://t.co/YwC9TIRo0o"},{"id":"1517922344739635201","text":"Are you here at the #FestivalofBooks?\n\nHere's how to make the best of it:\nhttps://t.co/yxF55LxJIl"},{"id":"1517922343615561729","text":"What is L.A. Times executive editor @meridak reading?\n\nA lot, to say the least. And he mentions @ProfessorEA's book #TrayvonGeneration in particular 📚\n\n(Here's his past talk w/ Dr. Alexander 👇) https://t.co/734jatp5Qp"},{"id":"1517921243973967875","text":"Unable to take Ukraine's capital, Kyiv, Russia’s war machine has since narrowed its ambitions, focusing on an intensifying battle to win the eastern Donbas region. https://t.co/kWFOoNUPvA"},{"id":"1517919888714596352","text":"Here at our annual #FestivalofBooks 📚, we're kicking off our #AskAReporter series.\n\nRight now: @cmonstah has a conversation with Los Angeles Times executive editor, @meridak \nhttps://t.co/yxF55LxJIl https://t.co/CstC3wlohD"},{"id":"1517919228279463936","text":"It has been a decade since P-22 surprised the world by appearing in Griffith Park, which scientists had considered too small and too surrounded by freeways to support an apex predator.\n\nWhat's next for L.A.'s favorite celebrity bachelor? \nhttps://t.co/93TLqLqqPM"},{"id":"1517916214156214274","text":"Deaths of homeless people in Los Angeles County soared by 56% in the year after the start of the pandemic, driven primarily by an increase in overdoses, according to a study published this month. https://t.co/3f5FoLg4I2"},{"id":"1517913943527727105","text":"A new episode of \"Binge Sesh,\" featuring true stories behind HBO's \"Winning Time\" and the Lakers dynasty, drops this Sunday. Follow and subscribe:\n\nSpotify➡️ https://t.co/6yn3Bxlqwa\nGoogle Podcasts➡️ https://t.co/NKkNoBUsaA \nApple Podcasts ➡️ https://t.co/XlscKSlEEw"},{"id":"1517912433808920579","text":"It’s National Park Week! And when it comes to national parks, L.A. travelers hit the jackpot: there are seven parks within driving distance that make for a perfect weekend getaway. https://t.co/FIVKm9B2UG"},{"id":"1517911428925169664","text":"Russian and Ukrainian troops faced off today along a 300-mile battlefront in the country’s east, where the Ukrainian military said its forces had beaten back more than half a dozen separate attacks. https://t.co/mu29icnw3T"},{"id":"1517907651786690565","text":"Breaking down our live @NFL #MockDraft: Join @LATimesfarmer and special guests as they break down their picks. \n\nMock draft: \nhttps://t.co/GYOdIgPODZ\n\nhttps://t.co/XABa4japdX"},{"id":"1517907400585482246","text":"The beat reporters know the teams better than anyone.\n\nOn Monday, reporters covering every team will be putting their expertise to the test when they make their picks in The Times’ #NFL reporters #mockdraft.\n\nHere’s how you can participate:\nhttps://t.co/GYOdIgydfp"},{"id":"1517906147482742787","text":"The median home price in Orange County reached $1 million last month, becoming the first Southern California county to ever hit that pricey mark. https://t.co/OzRGjDsJcV"},{"id":"1517906141774196736","text":"The Lakers were such a big favorite to win the @NBA title that wagers on them accounted for nearly a quarter — 22% — of every dollar bet on 2022 title futures.\n \n@DanWoikeSports &amp; @BA_Turner take a deep dive inside what sunk the Lakers’ championship hopes. https://t.co/5JmzjF8Dk0"}],"meta":{"newest_id":"1518018318661144576","oldest_id":"1517906141774196736","result_count":100,"next_token":"b26v89c19zqg8o3fpytnz4px5lnpf6iktxyfn1ecd34hp"}}